data/perf/profile-2026-09-09-counters/memcached/tsan-sound/client.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  11 secs]  0 threads:    20000000 ops, 1766236 (avg: 1749339) ops/sec, 50.38MB/sec (avg: 49.88MB/sec),  4.53 (avg:  4.57) msec latency

10        Threads
50        Connections per thread
40000     Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       162410.88          ---          ---         4.59643         4.15900        12.41500        17.02300     11084.51 
Gets      1623796.21       223.28   1623572.93         4.56932         4.12700        12.28700        16.63900     41064.67 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1786207.09       223.28   1623572.93         4.57179         4.12700        12.28700        16.63900     52149.18